{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "VALUATION_REQUEST",
    "1": "LEGAL_OPINION",
    "2": "TITLE_SEARCH",
    "3": "INSURANCE_RENEWAL",
    "4": "RELEASE_OF_COLLATERAL",
    "5": "SITE_VISIT",
    "6": "DOCUMENT_COLLECTION",
    "7": "GENERAL_INQUIRY"
  },
  "initializer_range": 0.02,
  "label2id": {
    "DOCUMENT_COLLECTION": 6,
    "GENERAL_INQUIRY": 7,
    "INSURANCE_RENEWAL": 3,
    "LEGAL_OPINION": 1,
    "RELEASE_OF_COLLATERAL": 4,
    "SITE_VISIT": 5,
    "TITLE_SEARCH": 2,
    "VALUATION_REQUEST": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.7.0",
  "vocab_size": 30522
}
